01  WS-AREA-1 PIC X(100).
01  WS-AREA-2 PIC 9(5) VALUE 0.
01  WS-AREA-2-VALID PIC 9(1) VALUE 0.

PROCEDURE DIVISION.
    MOVE "Hello, world!" TO WS-AREA-1
    IF WS-AREA-1 NUMERIC THEN
        MOVE 1 TO WS-AREA-2-VALID
        ADD 1 TO WS-AREA-2
    ELSE
        DISPLAY "Error: Invalid numeric value" 
    END-IF
    DISPLAY WS-AREA-1, WS-AREA-2, WS-AREA-2-VALID
    STOP RUN.